---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarConstraintType.FixedDistanceToHostFace
enum: Autodesk.Revit.DB.Structure.RebarConstraintType
source: html/b9417455-214c-30ef-e055-ad17ff1e0db3.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintType.FixedDistanceToHostFace

Handle is constrained to remain a fixed distance from a host Element surface.